<template>
  <svg class="w-4 h-4" fill="currentColor" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
    <!-- 下箭头 -->
    <path d="M18 22l-0.42-0.18L12 16.34 6.42 21.82A0.6 0.6 0 0 1 5.58 21.02l6-6a0.59 0.59 0 0 1 0.84 0l6 6a0.59 0.59 0 0 1 0 0.84A0.58 0.58 0 0 1 18 22z"></path>
    <!-- 上箭头 -->
    <path d="M12 9.16a0.6 0.6 0 0 1-0.42-0.18l-6-6a0.6 0.6 0 0 1 0.86-0.83L12 7.73l5.56-5.58A0.6 0.6 0 0 1 18.42 3l-6 6a0.6 0.6 0 0 1-0.42 0.16z"></path>
    <!-- 中间横线 -->
    <rect x="1.5" y="11.4" width="21" height="1.2" rx="0.6"></rect>
  </svg>
</template>
